In [9]:
from sqlalchemy import create_engine
import pandas as pd

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection = db.connect()

## Zadanie 1.

In [10]:
df = pd.read_sql('select * from category',con=connection)
print(df)

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

16 kategorii

## Zadanie 2

In [11]:
df = pd.read_sql('select * from category order by name ASC',con=connection)
print(df)

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

## Zadanie 3

In [12]:
df = pd.read_sql('select title from film order by release_year asc',con=connection)
print(df)

                 title
0      Chamber Italian
1     Grosse Wonderful
2      Airport Pollock
3    Bright Encounters
4     Academy Dinosaur
..                 ...
995     Young Language
996         Youth Kick
997       Zhivago Core
998  Zoolander Fiction
999          Zorro Ark

[1000 rows x 1 columns]

## Zadanie 4

In [13]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'",con=connection)
print(df)

             rental_date
0    2005-07-05 22:49:24
1    2005-07-05 22:51:44
2    2005-07-05 22:56:33
3    2005-07-05 22:57:34
4    2005-07-05 22:59:53
...                  ...
6704 2005-07-31 23:40:35
6705 2005-07-31 23:42:33
6706 2005-07-31 23:43:04
6707 2005-07-31 23:49:54
6708 2005-07-31 23:57:43

[6709 rows x 1 columns]

6709

## Zadanie 5

In [14]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2010-01-01' AND '2011-02-01'",con=connection)
print(df)

Empty DataFrame
Columns: [rental_date]
Index: []

0

## Zadanie 6

In [15]:
df = pd.read_sql('select amount from payment order by amount desc limit 1',con=connection)
print(df)

   amount
0   11.99

## Zadanie 7

In [16]:
df = pd.read_sql(
    "select * from country where country='Poland' or country='Nigeria' or country='Bangladesh'", con=connection)
print(df)
country_ids = df['country_id'].to_list()

   country_id     country         last_update
0          12  Bangladesh 2006-02-15 09:44:00
1          69     Nigeria 2006-02-15 09:44:00
2          76      Poland 2006-02-15 09:44:00

In [17]:
df = pd.read_sql(
    f"select * from city where country_id=ANY(ARRAY{country_ids})", con=connection)
# print(df)
city_ids = df['city_id'].to_list()

In [18]:
df = pd.read_sql(
    f"select * from address where city_id=ANY(ARRAY{city_ids})", con=connection)
# print(df)
address_ids = df['address_id'].to_list()

In [19]:
df = pd.read_sql(
    f"select * from customer where address_id=ANY(ARRAY{address_ids})", con=connection)
print(df)

    customer_id  store_id first_name  last_name  \
0            18         2      Carol     Garcia
1            21         1   Michelle      Clark
2            80         1    Marilyn       Ross
3           103         1     Gladys   Hamilton
4           128         1   Marjorie     Tucker
5           156         1     Bertha   Ferguson
6           198         2      Elsie     Kelley
7           232         2  Constance       Reid
8           250         2         Jo     Fowler
9           270         1       Leah     Curtis
10          277         2       Olga    Jimenez
11          280         2     Tracey    Barrett
12          284         1      Sonia    Gregory
13          286         1      Velma      Lucas
14          318         1      Brian      Wyman
15          329         2      Frank   Waggoner
16          332         1    Stephen     Qualls
17          380         1    Russell    Brinson
18          409         2     Rodney    Moeller
19          501         1      Ruben      Geary
20          558         1     Jimmie  Eggleston
21          562         1    Wallace      Slone
22          571         2    Johnnie   Chisholm
23          572         1     Sidney   Burleson

                                  email  address_id  activebool create_date  \
0       carol.garcia@sakilacustomer.org          22        True  2006-02-14
1     michelle.clark@sakilacustomer.org          25        True  2006-02-14
2       marilyn.ross@sakilacustomer.org          84        True  2006-02-14
3    gladys.hamilton@sakilacustomer.org         107        True  2006-02-14
4    marjorie.tucker@sakilacustomer.org         132        True  2006-02-14
5    bertha.ferguson@sakilacustomer.org         160        True  2006-02-14
6       elsie.kelley@sakilacustomer.org         202        True  2006-02-14
7     constance.reid@sakilacustomer.org         236        True  2006-02-14
8          jo.fowler@sakilacustomer.org         254        True  2006-02-14
9        leah.curtis@sakilacustomer.org         275        True  2006-02-14
10      olga.jimenez@sakilacustomer.org         282        True  2006-02-14
11    tracey.barrett@sakilacustomer.org         285        True  2006-02-14
12     sonia.gregory@sakilacustomer.org         289        True  2006-02-14
13       velma.lucas@sakilacustomer.org         291        True  2006-02-14
14       brian.wyman@sakilacustomer.org         323        True  2006-02-14
15    frank.waggoner@sakilacustomer.org         334        True  2006-02-14
16    stephen.qualls@sakilacustomer.org         337        True  2006-02-14
17   russell.brinson@sakilacustomer.org         385        True  2006-02-14
18    rodney.moeller@sakilacustomer.org         414        True  2006-02-14
19       ruben.geary@sakilacustomer.org         506        True  2006-02-14
20  jimmie.eggleston@sakilacustomer.org         564        True  2006-02-14
21     wallace.slone@sakilacustomer.org         568        True  2006-02-14
22  johnnie.chisholm@sakilacustomer.org         577        True  2006-02-14
23   sidney.burleson@sakilacustomer.org         578        True  2006-02-14

               last_update  active
0  2013-05-26 14:49:45.738       1
1  2013-05-26 14:49:45.738       1
2  2013-05-26 14:49:45.738       1
3  2013-05-26 14:49:45.738       1
4  2013-05-26 14:49:45.738       1
5  2013-05-26 14:49:45.738       1
6  2013-05-26 14:49:45.738       1
7  2013-05-26 14:49:45.738       1
8  2013-05-26 14:49:45.738       1
9  2013-05-26 14:49:45.738       1
10 2013-05-26 14:49:45.738       1
11 2013-05-26 14:49:45.738       1
12 2013-05-26 14:49:45.738       1
13 2013-05-26 14:49:45.738       1
14 2013-05-26 14:49:45.738       1
15 2013-05-26 14:49:45.738       1
16 2013-05-26 14:49:45.738       1
17 2013-05-26 14:49:45.738       1
18 2013-05-26 14:49:45.738       1
19 2013-05-26 14:49:45.738       1
20 2013-05-26 14:49:45.738       0
21 2013-05-26 14:49:45.738       1
22 2013-05-26 14:49:45.738       1
23 2013-05-26 14:49:45.738       1

## Zadanie 8

In [20]:
df = pd.read_sql(
    f"select address_id from staff", con=connection)
print(df)
address_ids = df['address_id'].to_list()

   address_id
0           3
1           4

In [21]:
df = pd.read_sql(
    f"select city_id from address where address_id=ANY(ARRAY{address_ids})", con=connection)
print(df)
city_ids = df['city_id'].to_list()

   city_id
0      300
1      576

In [22]:
df = pd.read_sql(
    f"select * from city where city_id=ANY(ARRAY{city_ids})", con=connection)
print(df)
country_ids = df['country_id'].to_list()

   city_id        city  country_id         last_update
0      300  Lethbridge          20 2006-02-15 09:45:25
1      576   Woodridge           8 2006-02-15 09:45:25

In [23]:
df = pd.read_sql(
    f"select country from country where country_id=ANY(ARRAY{country_ids})", con=connection)
print(df)

     country
0  Australia
1     Canada

Żaden pracownik nie mieszak w Argentynie lub Hiszpanii

## Zadanie 10

In [24]:
df = pd.read_sql(
    f"select inventory_id from rental", con=connection)
# print(df)
inv_ids = df['inventory_id'].to_list()

In [25]:
df = pd.read_sql(
    f"select film_id from inventory where inventory_id=ANY(ARRAY{inv_ids})", con=connection)
# print(df)
film_ids = df['film_id'].to_list()

In [26]:
df = pd.read_sql(
    f"select category_id from film_category where film_id=ANY(ARRAY{film_ids})", con=connection)
# print(df)
category_ids = list(set(df['category_id'].to_list()))

In [27]:
df = pd.read_sql(
    f"select name from category where category_id=ANY(ARRAY{category_ids})", con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

## Zadanie 11

In [28]:
def getCustomersFrom(countryList):
    df = pd.read_sql(
        f"select * from country where country=ANY(ARRAY{countryList})", con=connection)
    country_ids = df['country_id'].to_list()
    df = pd.read_sql(
        f"select * from city where country_id=ANY(ARRAY{country_ids})", con=connection)
    city_ids = df['city_id'].to_list()
    df = pd.read_sql(
        f"select * from address where city_id=ANY(ARRAY{city_ids})", con=connection)
    address_ids = df['address_id'].to_list()
    df = pd.read_sql(
        f"select * from customer where address_id=ANY(ARRAY{address_ids})", con=connection)
    customer_ids = df['customer_id'].to_list()
    return customer_ids

In [29]:
def getCategoriesFrom(customerList):
    df = pd.read_sql(
        f"select inventory_id from rental where customer_id=ANY(ARRAY{customerList})", con=connection)
    inventory_ids = df['inventory_id'].to_list()
    df = pd.read_sql(
        f"select film_id from inventory where inventory_id=ANY(ARRAY{inventory_ids})", con=connection)
    film_ids = df['film_id'].to_list()
    df = pd.read_sql(
        f"select category_id from film_category where film_id=ANY(ARRAY{film_ids})", con=connection)
    category_ids = list(set(df['category_id'].to_list()))
    df = pd.read_sql(
        f"select name from category where category_id=ANY(ARRAY{category_ids})", con=connection)
    return df['name']

In [30]:
print(getCategoriesFrom(getCustomersFrom(['United States'])))

0          Action
1       Animation
2        Children
3        Classics
4          Comedy
5     Documentary
6           Drama
7          Family
8         Foreign
9           Games
10         Horror
11          Music
12            New
13         Sci-Fi
14         Sports
15         Travel
Name: name, dtype: object

## Zadanie 12

In [31]:
df = pd.read_sql(
    f"select * from actor where (first_name='Olympia' and last_name='Pfeiffer') or (first_name='Julia' and last_name='Zellweger') or (first_name='Ellen' and last_name='Presley')", con=connection)
print(df)
actors_ids = df['actor_id'].to_list()

   actor_id first_name  last_name             last_update
0        93      Ellen    Presley 2013-05-26 14:47:57.620
1       171    Olympia   Pfeiffer 2013-05-26 14:47:57.620
2       186      Julia  Zellweger 2013-05-26 14:47:57.620

In [32]:
df = pd.read_sql(
    f"select * from film_actor where actor_id=ANY(ARRAY{actors_ids})", con=connection)
# print(df)
film_ids = df['film_id'].to_list()

In [33]:
df = pd.read_sql(
    f"select title from film where film_id=ANY(ARRAY{film_ids})", con=connection)
print(df)

                   title
0            Badman Dawn
1        Bilko Anonymous
2   Breakfast Goldfinger
3      Caribbean Liberty
4       Casper Dragonfly
..                   ...
64             Turn Star
65            Wait Cider
66          Women Dorado
67             Won Dares
68         Wyoming Storm

[69 rows x 1 columns]